tap "1password/tap"
tap "homebrew/bundle"
brew "zstd"
brew "webp"
brew "asimov"
brew "awscli"
brew "black"
brew "chezmoi"
brew "coreutils"
brew "difftastic"
brew "harfbuzz"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "git"
brew "git-secrets"
brew "gnu-sed"
brew "grep"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "node"
brew "pre-commit"
brew "python@3.10"
brew "rename"
brew "sccache"
brew "shellcheck"
brew "terraform"
brew "thefuck"
brew "virtualenv"
brew "wget"
brew "yt-dlp"
cask "1password-cli"
cask "pallotron-yubiswitch"
