tap "1password/tap"
tap "hashicorp/tap"
brew "zstd"
brew "webp"
brew "asimov"
brew "awscli"
brew "black"
brew "chezmoi"
brew "coreutils"
brew "csvkit"
brew "difftastic"
brew "elixir"
brew "harfbuzz"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "gh"
brew "git"
brew "git-secrets"
brew "gnu-sed"
brew "gradle"
brew "grep"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "node"
brew "openapi-generator"
brew "pre-commit"
brew "python@3.10"
brew "rename"
brew "sccache"
brew "tmux"
brew "uv"
brew "virtualenv"
brew "watch"
brew "wget"
brew "yt-dlp"
brew "hashicorp/tap/terraform"
cask "claude-code"
cask "pallotron-yubiswitch"
cargo "cargo-outdated"
cargo "cargo-udeps"
